# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)


list_1 = [-15, 10, 90, 2, -5, 1, 9, -4, 7, -10, -2, 40, -90, 0, 11, -4, 5, -7, 8, 9]
list_2 = []
max = 6
min = -6

# Вариант 1

for i in range(len(list_1)):
    if min <= list_1[i] <= max:
        print(i, end=' ')

# Вариант 2

# for i in range(len(lst_1)):
#     if list_1[i] >= min and list_1[i] <= max:
#         list_2.append(i)
# print(list_2)